Diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <basedOn>Document.ВКМ_ОбслуживаниеКлиента</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
//	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВКМ_ОбслуживаниеКлиента") Тогда
//		// Заполнение шапки
//		
//		Договор = ДанныеЗаполнения.Договор;
//		Комментарий = ДанныеЗаполнения.Комментарий;
//		Контрагент = ДанныеЗаполнения.Контрагент;
//		Организация = ДанныеЗаполнения.Организация;
//		Ответственный = ДанныеЗаполнения.Ответственный;
//		Основание = ДанныеЗаполнения.Ссылка;
//		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
//			НоваяСтрока = Товары.Добавить();
//			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
//			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
//		КонецЦикла;
//	КонецЕсли;
//	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	ЗаказПокупателя.Организация КАК Организация,
               |	ЗаказПокупателя.Контрагент КАК Контрагент,
               |	ЗаказПокупателя.Договор КАК Договор,
               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
               |	ЗаказПокупателя.Товары.(
               |		Ссылка КАК Ссылка,
               |		Номенклатура КАК Номенклатура,
               |		Количество КАК Количество,
               |		Цена КАК Цена,
               |		Сумма КАК Сумма
               |	) КАК Товары,
               |	ЗаказПокупателя.Услуги.(
               |		Ссылка КАК Ссылка,
               |		НомерСтроки КАК НомерСтроки,
               |		Номенклатура КАК Номенклатура,
               |		Количество КАК Количество,
               |		Цена КАК Цена,
               |		Сумма КАК Сумма
               |	) КАК Услуги
               |ИЗ
               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
               |ГДЕ
               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ВКМ_ЗаполнитьНаСервере(Объект) Экспорт
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВКМ_СуммаАбонентскойПлаты");
	
	СуммаАбонентскойПлаты = РеквизитыДоговора.ВКМ_СуммаАбонентскойПлаты;
		
	ЗначениеКонстантыНомАбонПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	ЗначениеКонстантыРабСпец = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НЕ ЗначениеЗаполнено(ЗначениеКонстантыНомАбонПлата) ИЛИ НЕ ЗначениеЗаполнено(ЗначениеКонстантыРабСпец) Тогда 
		
		Услуги.Очистить(); 
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнены константы: Абонентская плата или Работа специалиста ");

		Возврат;
		
	КонецЕсли; 
	
	Если  ЗначениеЗаполнено(Услуги) Тогда
		Услуги.Очистить();
	КонецЕсли;

	Если СуммаАбонентскойПлаты <> 0 Тогда
		
		НоваяСтрокаУслуги = Услуги;
		
		НоваяСтрокаУслуги = Услуги.Добавить();
		НоваяСтрокаУслуги.Номенклатура = ЗначениеКонстантыНомАбонПлата;
		НоваяСтрокаУслуги.Количество = 1;
		НоваяСтрокаУслуги.Цена = Договор.ВКМ_СуммаАбонентскойПлаты;
		НоваяСтрокаУслуги.Сумма = НоваяСтрокаУслуги.Количество * НоваяСтрокаУслуги.Цена;	
		ОбщегоНазначения.СообщитьПользователю("Заполнена сумма абонентской платы, которая составила  "
			+ НоваяСтрокаУслуги.Сумма + " руб.");

	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовОборот КАК КоличествоЧасов,
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаКОплатеОборот КАК СуммаКОплате,
	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Клиент КАК Клиент
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты(
	|			&НачалоМесяца,
	|			&КонецМесяца,
	|			Месяц,
	|			,
	|			Договор = &Договор
	|				И Клиент = &Клиент) КАК ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты";

	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если ЗначениеЗаполнено(Выборка.СуммаКОплате) И Выборка.СуммаКОплате <> 0 Тогда
		
		НоменклатураРаботыСпециалиста = ЗначениеКонстантыРабСпец;
		НоваяСтрокаУслуги = Услуги.Добавить();
		НоваяСтрокаУслуги.Номенклатура = НоменклатураРаботыСпециалиста;
		НоваяСтрокаУслуги.Количество = Выборка.КоличествоЧасов;
		НоваяСтрокаУслуги.Сумма = Выборка.СуммаКОплате; 
		НоваяСтрокаУслуги.Цена = НоваяСтрокаУслуги.Сумма/НоваяСтрокаУслуги.Количество;
		ОбщегоНазначения.СообщитьПользователю("Заполнена сумма выполненных работ по данному договору, которая составила "
			+ Выборка.СуммаКОплате + " руб.");
	КонецЕсли;

 КонецПроцедуры



#КонецОбласти

#КонецЕсли
